[
	"Faut pas confondre poubelle et fonction.",
	"Il est important de trouver la bonne taille de saucisson.",
	"Il devrait y avoir une armée de bras qui se lèvent pour me bombarder d'insultes.",
	"Le dernier calendrier en date… C’est un jeu de mots.",
	"Il faut pas mélanger les serviettes et les torchons comme disait l’autre.",
	"Tout va bien dans le meilleur des mondes comme disait Voltaire.",
	"Je peux dormir sur mes deux oreilles en écrivant ceci.",
	"Là on coupe les cheveux en quatre.",
	"La mémoire, enfin pas la mienne, mais celle de l’ordinateur.",
	"Ça c’est gentil, car vous restez en famille.",
	"Ça c’est garanti sur facture.",
	"Ça c’est de la musique d’avenir.",
	"Pour vos fonctions il y a deux éléments à avoir : le sel et le poivre.",
	"Il m’a mis un tournevis avec lequel j'arrive pas à visser.",
	"Je vous prends au détour d’un bois, je vous dis f.",
	"Le prototype c’est comme une descente à 50 degrés, ce qui compte c’est le premier virage.",
	"Une exception c’est comme une bulle de gaz sous l’eau",
	"Le gros de l’algorithme : oui, le fonds de commerce : non.",
	"Question à 20 francs : est-ce que ce choix est pertinent? Non.",
	"On a vu que int et long c’est kiffe-kiffe bourricot.",
	"Je peux y perdre des plumes comme disait l’autre.",
	"De toute façon j'aime pas être le seul à ne pas être d'accord.",
	"Ce qui va crasher à tous les coudi-coups dix coups.",
	"On a le beurre, l’argent du beurre et comme disait l’autre, le pot de la laitière.",
	"Il faut pas en faire un fromage comme disait l’autre.",
	"En 2 coups de cuillère à pot.",
	"Il faut remettre l’ouvrage dans le métier comme disait l’autre.",
	"Chaque biscuit de noel correspond à une classe.",
	"Dans le mot encapsulation, il y a le mot capsule.",
	"Pomme, je te mange, c’est ça la POO.",
	"On va changer de crèmerie comme disait l’autre.",
	"On a différents types de queues d’après nos besoins.",
	"Les pointeurs et autres plaisanteries",
	"Je vous l’ai expliqué hier? Oui? Bon alors je vous le réexplique.",
	"Des gens qui souffrent de flemmingite aiguë utilisent auto.",
	"Pour comprendre ce que c’est value_type, il faut faire un petit voyage.",
	"Ils ont pas utilisé un exemple aussi stupide que le mien, ils ont été intelligents.",
	"Si on prend un peu de hauteur comme disait l’autre.",
	"C’est bientôt noël, c’est la fête, prenons 100’000 éléments.",
	"Là on va perdre un temps géologique !",
	"Le fer est chaud, on les a encore en tête ses fonctions.",
	"Ce problème on va le résoudre au pic à glace.",
	"Là y’a rien de neuf sous l’soleil.",
	"Pas de jeu de mots, mais ils devraient faire preuve de moins d’inertie et effacer le tableau.",
	"Bref il a toutes les qualités.. Sous-entendu pour être jeté à la poubelle.",
	"A travers tous ces exercices qui vous ont secoué dans tous les sens.",
	"L’informatique c’est pas coder comme un bourrin, boum boum boum boum. Ça, c’est le type au fond de son garage.",
	"Ça c’est ce qu’on met entre les feuilles de salade pour qu’elle ait du goût.",
	"On va changer notre fusil d’épaule. Ou d’arc si vous préférez les flèches.",
	"Vous noterez qu'aucun de ces tableaux n’a été martyrisé.",
	"Tous ses éléments là mélangés: Milkshake.",
	"Merci de ne pas abuser de la dinde dont on a parlé tout à l’heure.",
	"Faut utiliser avec parcimonie comme disait l’autre.",
	"D’un point de vue efficacité, on ne joue pas dans la même ligue.",
	"On tripatouille tout un tas de choses.",
	"Il y a toute une foultitude de solutions comme disait l’autre.",
	"Un exemple vaut mieux que 1000 discours comme disait l’autre.",
	"Vous secouez comme un shaker, c’est ça random_shuffle.",
	"En le lui enfilant, si vous me pardonnez l’expression.",
	"Ça n’a pas bougé d’un epsilon.",
	"Il ne faut pas y aller à la petite semaine.",
	"Le beurre c’est l’espace mémoire, l’argent du beurre c’est que c’est une classe.",
	"Dans valarray il y a deux mots : val et array.",
	"Allez regarder le code dans le blanc des yeux.",
	"Faut pas y aller à la bûcheronne “boum boum tap tap”.",
	"Tous ces pauvres qui nous viennent du C.",
	"On peut dormir sur nos quatre oreilles parce un homme averti en vaut deux.",
	"Ces choses qu’on a vu en long en large en longueur en diagonale et en profondeur.",
	"String string c’est un couteau suisse.",
	"C’est un peu rébarbatif.",
	"On donne la sauce à travers cette longue litanie de fonctions.",
	"Tout vient à temps.. à qui qui attends.",
	"Comme on dit, il faut diviser pour régner.",
	"C’est pas bonnet blanc et blanc bonnet.",
	"Revenons à nos moutons comme disait l’autre.",
	"Alors évidemment on a fait des études d’informatique, pas d’egyptologie.",
	"Si vous avez envi d’empoigner par le col celui qui a mis à disposition le code, ça va pas.",
	"Votre système se crash et vous avez plus que vos yeux pour pleurer.",
	"Vous imaginez le nombre de personnes qui vont vous attendre à 5h sur le parking, et c’est pas pour vous encenser.",
	"Un programme en POO, c’est comme un match du Rugby.",
	"Messieurs les Anglais tirez les premiers.",
	"Soit vous êtes un pauvre diable, et vous ne recevez pas de cadeau. Soit vous êtes riches et vous recevez un cadeau. C’est injuste la société.",
	"Mais là, ça mange pas de foin comme disait l’autre.",
	"Vous ne pouvez pas le faire, et si vous le faites, je vous souhaite de prendre de longues vacances",
	"Quand je dis que vous êtes inefficaces, OUI, vous êtes inefficaces.",
	"Je travaille pas sur une balle de ping-pong, je travaille sur un pays.",
	"Là on est dans 2001 l'Odyssée de l'espace.",
	"On n'a pas violé la Constance",
	"L’un est un pavé dans la marre, l’autre un détail.",
	"Ca dépend des années, c'est un peu comme les cuvées de pinard.",
	"Comme d’habitude faut savoir ce qu’il faut se faire avant de faire.",
	"J’ai un problème. Enfin pas moi, le compilateur.",
	"C’est un patron.. Au sens couture du terme.. Comme un moule ! Comme pour faire une robe ou une chemise. Un Patron !",
	"Un ami est en principe une personne.",
	"Et là vous recevrez une bordée d’insulte de la part de votre compilateur.",
	"Si vous utilisez une librairie faite par des guignols, vous aurez un programme de ? Guignol.",
	"D’un point de vue de la logique, ce n’est pas vraiment très logique de faire comme ça.",
	"On y va daredare, sans sourciller d’un sourcil.",
	"Il y a eu quelque chose de pas catholique dans mon appel. Qu’est-ce qui n’est pas catholique ?",
	"On a begin et end qui puis.. Vas-y kiki!",
	"Si vous affichez un message en français et que votre utilisateur est un Chinois, ce n’est pas un jeu de mots, mais pour lui ça sera du chinois.",
	"Parce qu’il a la flemme. Parce qu’il est inconscient. Parce qu’il est stupide. Il a N raisons.",
	"Vous êtes un aficionado du inline vous.",
	"Ça va vous permettre à vous assurer que vous ne laissez pas le bordel dans l’appart.",
	"Si on ne fait pas le ménage en quittant l’appartement, on peut dire que la conciergerie fera le travail.",
	"D’un point de vue logique, c’est pas logique d’utiliser cette logique... La logique elle est pas respectée ici...la logique elle prend un coup.",
	"Pour les messieurs du fond là, vers le chauffage, qui vont faire de l’embarqué.",
	"La macro n’est pas à utiliser comme un grand singe.",
	"On va passer dessus comme chat sur braise comme disait l’autre",
	"Pour ceux qui le savent c'est tant mieux et pour ceux qui ne le savent pas c'est tant mieux aussi car on va le réexpliquer !",
	"Ça consiste à se dire : URH",
	"Dans les tests, vous pourrez brûler des étapes, mais ne vous brûlez pas les ailes.",
	"Comme ça on voit où l’abruti a fait l’abruti. Sinon, vous continuez à aider un abruti.",
	"Une personne, soit c’est un suisse, soit c’est un étranger.",
	"Si vous nommez votre fichier texte en .jaimelesfrites, si vous l'utilisez dans un éditeur de texte usuel tel que Notepad++, même s'il a été fait en Belgique c'est pas sûr qu'il puisse lire votre fichier.",
	"Je suis content d’avoir été clair comme de l’eau de roche de nos Alpes suisse.",
	"Bon soyons optimistes, c’était pas catastrophique mais c’était mauvais.",
	"On nous a dit : ",
	"Avant Noël les gens sont un peu plus éméchés, ils parlent un peu plus.",
	"Mais les administrateurs ont dit : ",
	"Le temps c'est de l'argent mais on prend pas le temps d'aller faire tout ça.",
	"Le codage c’est la touche finale, c’est la peinture qu’on met sur la carrosserie...mais d’abord faut faire la carrosserie.",
	"Le passage de l’un à l’autre ne se fait pas au pifomètre.",
	"On y passe un certain temps voire un temps certain.",
	"Commençons par les avantages, aujourd’hui c’est vendredi.",
	"Pourquoi pas...sauf que ça aurait été débile.",
	"Monsieur X, qu’est-ce qui nous veut ? (pour répondre à une question)",
	"Il y a une épidémie de pipi ou bien?",
	"J’ai cru que j’étais Jeanne d’Arc, que j’entendais des voix",
	"Pas besoin de chercher midi à 15h, 14h suffit",
	"Je m'excuse pour ceux qui sont au fond mais c'est bien fait pour eux, ils avaient qu'à être plus près",
	"Ce logiciel, parce qu’il était bien fichu et gratuit, est devenu payant.",
	"Qu’est-ce qu’il y a de neuf sous le soleil par rapport aux exos précédents ?",
	"Les procédures stockées ce sont les gardiens du temple !",
	"Car quand on part mal, on arrivera mal",
	"Modérons nos ardeurs, comme disait l’autre.",
	"Histoire de donner un peu d’envergure au mot “bordel”",
	"Moi je casse tout, direct!",
	"Ça revient comme la marée, chaque jour.",
	"Personne n’a réagi en disant “ÖöööÖÖöÖöö” !",
	"Avec des “si”, on pourrait mettre Paris en bouteille comme disait l’autre.",
	"Ici, c’est un peu comme tirer sur un pigeon avec un missile.",
	"Exists existe. Ha! C’était un jeu de mots!",
	"Un homme averti en valant trois…",
	"C’est toujours dommage de perdre des points.",
	"C’était pour voir si le MOUSSEUX ne vous a pas trop ÉMOUSSÉ l’esprit.",
	"Chaque fois que je dois dire “Beaujolais” je dois dire “France”. Et ça ça me tue!",
	"Je peux ou me pendre, ou me tirer une balle.",
	"Ça peut conduire à plusieurs solutions finales.",
	"On va pas salir la tradition.",
	"Je pousse le bouchon à l’extrême.",
	"A partir de là, ça tombe comme un fruit mûr.",
	"On a le beurre, l’argent du beurre et le pot de la laitière.",
	"Ici, le using namespace, il mange pas de foin, comme disait l’autre.",
	"On va passer là dessus comme chat sur braise.",
	"Comme disait Snoopy, l’action naît de la réflexion.",
	"C’est space, comme disait l’autre.",
	"On va pas être plus catholoique que le pape",
	"On pédale dans le yoghurt",
	"Comment partager entre plusieurs fichiers c'est à dire partager entre plusieurs fichiers",
	"On en perd son latin",
	"On va remettre l'église au milieu du village",
	"Tips and tricks",
	"Comme Jeanne D'Arc je n'entends pas des voix, mais je vois des mains se lever",
	"On ne va pas chercher midi à 14h... ni à 15 !",
	"C'est kif-kif bourricot !",
	"Découper un problème c'est comme découper un saucisson",
	"Qui Bonhomme allant...",
	"Vous pouvez dormir sur vos 4 oreilles, car un homme averti en vaut deux et que 2x2 = 4",
	"On peut pas avoir/on veut le beurre, l'argent du beurre et la fille de la laitière !!!",
	"ça devrait faire TILT... si ça ne fait pas TILT ba je vais l'faire... TILT !!!!",
	"On viol joyeusement l'encapsulation",
	"ça mange pas de foin !",
	"Vous n’allez pas courber l'après-midi et hop salut les lapins !",
	"La maison ne reculant devant aucun sacrifice... :-)",
	"Il y a manière et manière !",
	"Ce qu'il y a de bien avec les strings, c'est que c'est transparent !",
	"Faire pointer un pointeur aux fraises !",
	"Tout est clair comme de l'eau de roche, cristalline, de nos Alpes suisses !",
	"Si la queue est vide, on lève l'exception queue vide !",
	"advienne que pourra",
	"une fonction ultra-violente",
	"c'est un peu le chat qui se mord la queue",
	"Il existe parmi la foultitude....comme disait l'autre... de classe...",
	"On va passer là-dessus comme chat sur braise !",
	"En C c'est un peu caca-chenil !",
	"Trêve de plaisanterie à part ..",
	"Tous les chemins mènent à Rome comme disait l'autre !",
	"Autre chose de cet acabit-là.",
	"Excusez-moi du terme,",
	"On viole tous les bons principes du génie logiciel !",
	"Il n’y en a pas une d'identique, elles ont chacune leur petit dada ! (fonction get())",
	"Ce qu'on écrivait en deux coups de cuillère à pot...",
	"Et là, ça devient carrément verbeux !",
	"Un patron c'est comme en couture, mais rassurez-vous, je ne fais pas de couture !",
	"Que j'manipule des int des float des patates ou des dates, c'est la même chose !!",
	"Je tenterais de violer l'encapsulation",
	"Je ne veux pas en dire du mal, parce que je me critiquerais moi-même. C'est une plaisanterie.",
	"Alors encore une fois, comme je l'ai déjà dit...",
	"pédaler dans le yoghourt",
	"Je vais changer mon fusil d'épaule",
	"Violer complètement la sécurité d'une classe... on m'a donné les droits, j'm'en fiche !!!",
	"Il tombe comme un cheveu sur la soupe",
	"Remettre l'ouvrage sur le métier",
	"On trompe l'utilisateur sur la marchandise",
	"C'est garanti sur facture, c'est 100% garanti !",
	"Une fois n'est pas coutume, on va s'arrêter 2-3 minutes avant !",
	"et donc l'utilisateur peut dormir sur ses 3 oreilles",
	"Comme disait Snoopy, de la réflexion nait l'action et non l'inverse",
	"La mayonnaise n'a jamais pris",
	"Si l'utilisateur fait une saisie erronée ça fera crack-boom, sous-entendu il y aura une erreur",
	"Ne nous limitons pas à l'anglicisme !! Luttons Gaulois !!",
	"Comme cul et chemise",
	"Moi j'men lave les mains, un peu comme Ponce Pilate",
	"faire d'Einstein deux coups !",
	"Je me fais l'avocat des tableaux",
	"Chacun pour soi et le Bon Dieu pour tous",
	"La difficulté elle est allé-allé-hop et le résultat du coup est aussi allé-allé-hop !",
	"Repousser les bornes des limites",
	"Faut pas piquer des vers !",
	"Ça ne claque pas des doigts !",
	"Les bonnes réponses se comptent sur les doigts d'une main amputée de plusieurs doigts",
	"On ne sait plus à quel Saint se vouer",
	"La tête d'une queue pointe sur un noeud",
	"Pourquoi on le vendrait pas, pour se faire un peu des billes comme disait l'autre !",
	"Mystère et boule d'acier",
	"Il touche profond comme disait l'autre ! (En parlant de bas niveau)",
	"On va pas être plus catholique que le pape",
	"On peut se reposer sur ces quatre oreilles, comme disait l'autre un homme averti en vaut deux",
	"Loin sans faux",
	"Tout de suite aller sur le chantier pour construire une maison sans plan",
	"Comme disait l’autre, allons lentement nous sommes pressés.",
	"Des temps d’execution qui EXPLOSENT",
	"Ca c’est de la musique d’avril",
	"Je vois déjà au fond de votre prunelle la lumière s’allumer",
	"Si vous gagnez de la place parci parlà, c’est des peanuts comme on dit",
	"On a mit le cheni si vous me passez l’expression.",
	"Pour mettre un peu de sel sur le steak",
	"Rapide comme chat sur feu",
	"Mais si vous faites ça vous êtes un pétochard"
]